Revit 2024 API
ViewPrintingEventArgs.GetSettings Method
 Get the print settings of the active printing session.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IPrintSetting GetSettings()
Visual Basic
Public Function GetSettings As IPrintSetting
Visual C++
public:
IPrintSetting^ GetSettings()
See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace